# This query uses regex to match 3 naming schema, all related to voicemails.
# Voicemails continue to be a common and successful phishing vector, and implementing rules based on these naming schema can significantly reduce these types of messages.
#
EmailAttachmentInfo
| where Timestamp > ago (30d)
| where FileType contains "html"
| where FileName matches regex @"[^a-zA-Z0-9]VM[^a-zA-Z0-9]"
or FileName matches regex @"^Aud.|.[A|a]ud"
or FileName matches regex @".[P|p]lay|[P|p]lay."
or FileName matches regex @"[\d\W_][C][A-Z]{3}\.html$"
| join EmailEvents on NetworkMessageId | where DeliveryAction == "Blocked"
| where SenderFromDomain !in~ ("exclusion1.org","exclusion2.edu","exclusion3.com")
| project-reorder Timestamp, Filename, Subject, SenderDisplayName, SenderFromAddress,SenderFromDomain
//| where OrgLevelPolicy has "Exchange" //uncomment this line out later to see wh ich ones were caught by the new exchange transport rule
